# Exercícios Aula 01

In [1]:
import pandas as pd

data = pd.read_csv('datasets/kc_house_data.csv')

In [3]:
#1. Quantas casas estão disponíveis para compra?
data.shape[0]

#R: 21.613 casas estão disponíveis para compra

21613

In [4]:
#2. Quantos atributos as casas possuem?
data.shape[1]

#R: As casas possuem 21 atributos

21

In [5]:
#3. Quais são os atributos?
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [9]:
#4. Qual a casa mais cara do portfólio?
data[['id', 'price']].sort_values('price', ascending=False)

#R: A casa mais cara do portfólio é a de id 6762700020, custando R$ 7.700.000,00

               id      price
7252   6762700020  7700000.0
3914   9808700762  7062500.0
9254   9208900037  6885000.0
4411   2470100110  5570000.0
1448   8907500070  5350000.0
...           ...        ...
8274   3883800011    82000.0
16198  3028200080    81000.0
465    8658300340    80000.0
15293    40000362    78000.0
1149   3421079032    75000.0

[21613 rows x 2 columns]

In [10]:
#5. Qual a casa com o maior número de quartos?
data[['id', 'bedrooms']].sort_values('bedrooms', ascending=True)

#R: A casa com o maior número de quartos é a com id 2402100895, com 33 quartos

               id  bedrooms
9773   3374500520         0
6994   2954400190         0
9854   7849202190         0
19452  3980300371         0
14423  9543000205         0
...           ...       ...
15161  5566100170        10
13314   627300145        10
19254  8812401450        10
8757   1773100755        11
15870  2402100895        33

[21613 rows x 2 columns]